#### GetAllStructuralConnectionApprovalTypes Method

---

|  |
| --- |
| StructuralConnectionApprovalType Class   See Also |

Collects the ids of all StructuralConnectionApprovalTypes in the document.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static void GetAllStructuralConnectionApprovalTypes( 	Document cda, 	out ICollection<ElementId> ids ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub GetAllStructuralConnectionApprovalTypes ( _ 	cda As Document, _ 	<OutAttribute> ByRef ids As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void GetAllStructuralConnectionApprovalTypes( 	Document^ cda,  	[OutAttribute] ICollection<ElementId^>^% ids ) ``` |

#### Parameters

cda
:   Type:  Autodesk.Revit.DB Document

ids
:   Type:  System.Collections.Generic ICollection   ElementId   %

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

StructuralConnectionApprovalType Class

Autodesk.Revit.DB.Structure Namespace